Revit 2027 API
AnalyticalMember.SetCurve Method
 Sets the curve for the Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCurve(
	Curve curve
)
Public Sub SetCurve (
	curve As Curve
)
public:
void SetCurve(
	Curve^ curve
)
member SetCurve :
        curve : Curve -> unit
Parameters
curve Curve
Exceptions
Exception | Condition
ArgumentException |  The input curve is not bound. -or- The provided curve is not supported.
ArgumentNullException |  A non-optional argument was null
Remarks
 End nodes connection will be lost if the curve changes position. The curve must be bounded. The curve can be:
Line
Arc
Ellipse
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace